In [2]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns

/usr/local/lib/python3.6/dist-packages/statsmodels/tools/_testing.py:19: FutureWarning: pandas.util.testing is deprecated. Use the functions in the public API at pandas.testing instead.
  import pandas.util.testing as tm

In [15]:
data=pd.read_csv("train.csv")

# filling missing data with last valid observation
data = data.fillna(method='ffill')
data.head()

   PassengerId  Survived  Pclass  ...     Fare Cabin  Embarked
0            1         0       3  ...   7.2500   NaN         S
1            2         1       1  ...  71.2833   C85         C
2            3         1       3  ...   7.9250   C85         S
3            4         1       1  ...  53.1000  C123         S
4            5         0       3  ...   8.0500  C123         S

[5 rows x 12 columns]

In [19]:
Y= data["Survived"]

In [23]:
data.drop(["Survived"], axis = 1)

     PassengerId  Pclass     Sex   Age  SibSp  Parch     Fare Cabin Embarked
0              1       3    male  22.0      1      0   7.2500   NaN        S
1              2       1  female  38.0      1      0  71.2833   C85        C
2              3       3  female  26.0      0      0   7.9250   C85        S
3              4       1  female  35.0      1      0  53.1000  C123        S
4              5       3    male  35.0      0      0   8.0500  C123        S
..           ...     ...     ...   ...    ...    ...      ...   ...      ...
886          887       2    male  27.0      0      0  13.0000   C50        S
887          888       1  female  19.0      0      0  30.0000   B42        S
888          889       3  female  19.0      1      2  23.4500   B42        S
889          890       1    male  26.0      0      0  30.0000  C148        C
890          891       3    male  32.0      0      0   7.7500  C148        Q

[891 rows x 9 columns]

In [33]:
data.drop(["Cabin"], axis = 1,inplace = True)

In [34]:
data

     PassengerId  Survived  Pclass     Sex  ...  SibSp  Parch     Fare  Embarked
0              1         0       3    male  ...      1      0   7.2500         S
1              2         1       1  female  ...      1      0  71.2833         C
2              3         1       3  female  ...      0      0   7.9250         S
3              4         1       1  female  ...      1      0  53.1000         S
4              5         0       3    male  ...      0      0   8.0500         S
..           ...       ...     ...     ...  ...    ...    ...      ...       ...
886          887         0       2    male  ...      0      0  13.0000         S
887          888         1       1  female  ...      0      0  30.0000         S
888          889         0       3  female  ...      1      2  23.4500         S
889          890         1       1    male  ...      0      0  30.0000         C
890          891         0       3    male  ...      0      0   7.7500         Q

[891 rows x 9 columns]

In [35]:
from sklearn.preprocessing import OneHotEncoder 
from sklearn.compose import make_column_transformer
column_trans=make_column_transformer(
    (OneHotEncoder(),['Pclass','Sex','Embarked'] ),
    remainder ='passthrough'
)

In [60]:
a=column_trans.fit_transform(data)

In [61]:
print(a[1,:])

[ 1.      0.      0.      1.      0.      1.      0.      0.      2.
  1.     38.      1.      0.     71.2833]

In [57]:
# feature_list=["pclass1","pclass2","pclass3",	"male",	"female",	"em1",	"em2","em3",	"SibSp",	"Parch",	"x1",	"y1","fare"]

In [70]:
split_ratio = int(len(data)*0.75)

x_train =a[0:split_ratio] 
# np.array(a[:].iloc[0:split_ratio])
y_train = np.array(Y.iloc[0:split_ratio])

x_test  = a[split_ratio:0] 
y_test  = np.array(Y.iloc[split_ratio:])

In [65]:
x_train

array([[ 0.    ,  0.    ,  1.    , ...,  1.    ,  0.    ,  7.25  ],
       [ 1.    ,  0.    ,  0.    , ...,  1.    ,  0.    , 71.2833],
       [ 0.    ,  0.    ,  1.    , ...,  0.    ,  0.    ,  7.925 ],
       ...,
       [ 0.    ,  1.    ,  0.    , ...,  2.    ,  0.    , 73.5   ],
       [ 0.    ,  1.    ,  0.    , ...,  0.    ,  0.    , 13.    ],
       [ 0.    ,  0.    ,  1.    , ...,  0.    ,  0.    ,  7.775 ]])

In [71]:
from sklearn.neural_network import MLPClassifier

model = MLPClassifier(solver='adam', alpha=0.01, hidden_layer_sizes=(30,20), max_iter=2500)

model.fit(x_train, y_train)

MLPClassifier(activation='relu', alpha=0.01, batch_size='auto', beta_1=0.9,
              beta_2=0.999, early_stopping=False, epsilon=1e-08,
              hidden_layer_sizes=(30, 20), learning_rate='constant',
              learning_rate_init=0.001, max_fun=15000, max_iter=2500,
              momentum=0.9, n_iter_no_change=10, nesterovs_momentum=True,
              power_t=0.5, random_state=None, shuffle=True, solver='adam',
              tol=0.0001, validation_fraction=0.1, verbose=False,
              warm_start=False)

In [75]:
from sklearn.metrics import accuracy_score

x_train_pred = model.predict(x_train)
print("Training accuracy: ",accuracy_score(y_train, x_train_pred))

Training accuracy:  1.0